Revit 2026 API

# MassSurfaceDataSurfaceDataSource Property

---

Indicates whether the MassSurfaceData properties are driven by the EnergyDataSettings of the Document or are overridden for the surface.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MassSurfaceDataSource SurfaceDataSource { get; set; }
```
```vb
Public Property SurfaceDataSource As MassSurfaceDataSource
	Get
	Set
```
```cpp
public:
property MassSurfaceDataSource SurfaceDataSource {
	MassSurfaceDataSource get ();
	void set (MassSurfaceDataSource value);
}
```
```fsharp
member SurfaceDataSource : MassSurfaceDataSource with get, set
```

#### Property Value

MassSurfaceDataSource

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The surface data source does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The Construction property is not governed by this setting and has a separate value to indicate if it is to be synchronized with EnergyDataSettings.

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace